// 0. 프론트엔드 개발의 배경
// 1. 2000년대 웹의 모습
// 1.1 정적인 문서 위주의 환경 (HTML + CSS)
// 1.2 2004년 Ajax, 2006 jQuery,
// -> 서버에 직접 페이지를 요청하지 않고도 페이지 일부만 갱신할 수 있는 동적인 웹 시대가 열립니다.
// 1.3 애플리케이션의 규모가 커지면 커질수록 DOM 조작이 복잡해지고 유지보수가 어려워졌다는 점

// 2. 프레임워크, 웹을 개발하기 위한 기본적인 아키텍쳐가 적용된 프로그램
// 2.1 Angular (2010년), 구글
// 2.1.2 Javascript 기반, MVC(Model-View-Controller) 아키텍쳐
// 2.1.3 양방향 데이터 바인딩, 대규모 웹 애플리케이션에 특화된 설계 & 기능 제공
// 2.1.4 프로젝트 규모가 커질수록 데이터 흐름 추적 어려웠다. 프레임워크 굉장히 무거웠다. 성능적으로도 문제가 발생함

// 2.2 React (2013), 페이스북(현 메타)
// 2.2.1 페이스북 -> 앵귤러를 사용해서 개발
// 2.2.1.1 페이스북 뉴스피드처럼 자주, 부분적으로 갱신되는 초대형 UI에서는 성능 문제가 발생함
// 2.2.1.2 앵귤러의 성능 문제를 개선하고자하는 연구 -> UI 순수 함수로 만들면 복잡성 줄일 수 있고, 성능도 개선할 수 있다.
// 2.2.2 리액트 핵심 아이디어는 UI,
// 2.2.2.1 단방향 데이터 바인딩, 데이터 흐름 추적을 쉽게했고, 성능을 향상 시킴
// 2.2.2.2 가상 돔(Virtual Dom),
// 2.2.2.2.1 사족...  스벨트(svelte), 개발하고 있는 핵심 개발자중 1명, 컨퍼런스
// 2.2.2.2.2 가상 돔은 오히려 렌더링 성능을 저하시킨다.

// 2.3 Vue.JS (2014)
// 2.3.1 구글에서 일을 하고 있던 에반 유 (Evan You), 만들었음
// 2.3.2 앵귤러를 사용해서 프로젝트를 진행하고 있었는데 -> 문제점 느끼고 있었음
// 2.3.3 사이드프로젝트(회사일 하면서, 퇴근하고 짬짬이), 프레임워크를 개발하는 사이드프로젝트
// 2.3.4 최초로 구글에 신규 프로젝트에 앵귤러를 안쓰고 자기가 개발한거 씀
// 2.3.5 구글 동료들이 굉장히 큰 호응 -> ? -> Vue.JS
// 2.3.6 어떤 라이브러리나 프레임워크보다도 더 배우기 쉽고 빠르게 웹 애플리케이션을 만드는 게 슬로건
// 2.3.6.1 앵귤러, 리액트 더 배우기 쉽게 하겠다. 그리고 빠르게 애플리케이션을 만들게 하겠다.
// 2.3.6.1.1 가볍다. 가상 DOM, 양바향데이터바인딩
// 2.3.6.1.2 후발 주자는 선발 주자의 장점을 흡수해서 단점을 보완해야함
// 2.3.6.1.3 선발 주자 -> 점유율 확보 (1996 - 2008, 크롬)
// 2.3.6.2 뷰 -> 앵귤러와 리액트의 장점 (양방향 바인딩 + 가상 DOM), 뷰 -> 급상승하기 시작함

// 앵귤러, 뷰, 리액트

// 3. npm - Node Package Manager
// 3.1 node.js 패키지를 설치, 관리하는 패키지 매니저 도구

// 4. npx(npm package executor, 비표준) - Npm Package Runner
// 4.1 npm 패키지를 실행하는 도구
