// 1. TS (확장 문법)
// 1.1 JS에 타입을 추가한 언어
// 1.2 타입 -> 데이터의 종류
// 1.3 TS는 JS의 슈퍼셋
// 1.3.1 슈퍼셋 => 어떤 집합이나 시스템이 다른 집합이나 시스템을 모두 포함하면서도 추가적인 요소를 더 가지고 있는 것

// 1.2 마이크로소프트에서 개발
// 1.2.1 JS보다 좀 더 정확하고 안정적인 코드 작성 가능
// 1.2.2 JS는 굉장이 유연한 언어 => 언어적으로 굉장히 유연함은 큰 제약이 없다는 것을 의미
// 1.2.3 TS는 JS에 타입을 추가 => 정적 타입
// let num: number; => num 변수를 숫자로 타입을 지정했기에 문자열이나, bool타입 같은 다른 타입은 할당할 수 없음

// 2. 최신 tsconfig.json 설정
// 2.1 ts -> js 모듈로 변환
// 2.1.1 <script type="module" src="..."/>

// 2.2 최신 설정을 바꾸는 방법
// 2.2.1 isolatedModules -> false
// 2.2.2 moduleDetection -> "auto"
// 2.2.3 <script defer src="..."/>
